Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: This bug describes a security problem in a package (e.g., bad permissions allowing access to data that shouldn't be accessible; buffer overruns allowing people to control a system in ways they shouldn't be able to; denial of service attacks that should be fixed, etc).
pt_pt: Este bug descreve um problema de segurança em um pacote (por exemplo, permissões erradas liberando o acesso a dados que não deveriam estar acessíveis; buffer overruns permitindo que pessoas controlem um sistema de uma maneira que não deveriam ser capazes de fazer; ataques de negação de serviço que precisam ser corrigidos, etc).

source: Most security bugs should also be set at critical or grave severity.
pt_pt: A maioria dos bugs de segurança também devem ser definidos para uma severidade critical ou grave.

source: This bug applies to the upstream part of the package.
pt_pt: Este bug aplica-se à parte do pacote sob responsabilidade do(a) desenvolvedor(a) original.

source: The maintainer has looked at, understands, and basically agrees with the bug, but has yet to fix it.
pt_pt: O(A) mantenedor(a) do pacote verificou, entendeu e basicamente concorda com o bug, mas ainda tem que consertá-lo.

source: (Use of this tag is optional; it is intended mostly for maintainers who need to manage large numbers of open bugs.)
pt_pt: O uso dessa tag é opcional; ela é usada para aqueles(as) mantenedores(as) que precisam gerenciar uma grande quantidade de bugs em aberto.

source: The bug has been fixed by the upstream maintainer, but not yet in the package (for whatever reason: perhaps it is too complicated to backport the change or too minor to be worth bothering).
pt_pt: O bug foi corrigido pelo(a) desenvolvedor(a) original, mas ainda não foi corrigido no pacote (por uma razão qualquer: talvez seja muito complicado fazer a migração da mudança ou é uma mudança tão pequena que não vale a pena).

source: The bug has been fixed in the package of the experimental distribution, but not yet in the unstable distribution.
pt_pt: O bug foi corrigido no pacote da versão experimental, mas ainda não foi corrigido na versão instável (unstable).

source: This bug is relevant to the development of debian-installer.
pt_pt: Esse bug é importante para o desenvolvimento do instalador do Debian.

source: It is expected that this will be used when the bug affects installer development but is not filed against a package that forms a direct part of the installer itself.
pt_pt: É esperado que essa tag seja usada quando o bug afetar o desenvolvimento do instalador, mas não está associado a um pacote que faz parte do próprio instalador.

source: This bug affects support for Internet Protocol version 6.
pt_pt: Esse bug afeta o suporte à versão 6 do Protocolo de Internet (IP).

source: This bug affects support for large files (over 2 gigabytes).
pt_pt: Esse bug afeta o suporte a arquivos grandes (maiores que 2 gigabytes)

source: This bug is relevant to the localisation of the package.
pt_pt: Este bug é relevante para a localização do pacote.

source: This bug affects accessibility for users with disabilities.
pt_pt: Este bug afeta a acessibilidade para usuários(as) com deficiências.

source: It particularly impacts usability by people who rely on assistive (or other adaptive) technology to use the system/package.
pt_pt: Ele afeta particularmente a usabilidade por pessoas que dependem de tecnologia assistiva (ou outra adaptativa) para usar o sistema/pacote.

source: The package fails to build from source.
pt_pt: O pacote falha ao ser construído a partir do código-fonte.

source: If the bug is assigned to a source package, that package fails to build.
pt_pt: Se o bug foi atribuído para um pacote-fonte, aquele pacote falha na construção.

source: If the bug is assigned to a binary package, the affected source packages fail to build.
pt_pt: Se o bug foi atribuído para um pacote binário, os pacotes-fonte afetados falham na construção.

source: The tag is applicable to non-standard build environments (e.g. using Build-Depends from experimental), but the severity should be below serious (release critical) in such cases.
pt_pt: A tag é aplicável para ambientes de construção não padrões (por exemplo, usando Build-Depends da experimental), mas a severidade deve ser abaixo de serious (release critical) nesses casos.

source: These are release tags, which have two effects.
pt_pt: Estas são tags de versão, que possuem dois efeitos.

source: When set on a bug, the bug can only affect the particular release (though it may also affect other releases if other release tags are set) but otherwise normal buggy/fixed/absent rules apply.
pt_pt: Quando colocada em um bug, o bug pode afetar apenas aquela versão em particular (embora ele também possa afetar outras versões se outras tags de versão foram colocadas), caso contrário são aplicadas regras normais de problemático/corrigido/inexistente.

source: The bug also should not be archived until it is fixed in the release.
pt_pt: O bug também não deve ser arquivado até que seja corrigido na versão.

source: This release-critical bug is to be ignored for the purposes of releasing the particular release.
pt_pt: Este bug release-critical é para ser ignorado, permitindo, assim, o lançamento dessa versão em particular.

source: These tags should only be used by the release manager(s); do not set it yourself without explicit authorization from them.
pt_pt: Estas tags devem ser usadas somente pelo(s)/pela(s) gerente(s) de lançamento; não defina isso sozinho sem a autorização explícita dele(s)/dela(s).

source: Some info on distribution-specific tags: the -ignore tags ignore the bug for the purposes of testing propagation.
pt_pt: Algumas informações sobre tags específicas de versão: As tags -ignore ignoram o bug para permitir a propagação para a teste (testing).

source: The release tags indicate that the bug in question should not be archived until it is fixed in the set of releases specified.
pt_pt: As tags de versões indicam que o bug em questão não deve ser arquivado antes de ser corrigido no conjunto das versões marcadas.

source: The release tags also indicate that a bug should only be considered buggy in the set of releases specified.
pt_pt: As tags de versão também indicam que um bug somente pode ser considerado problemático em um conjunto de versões específicas.

source: [In other words, the bug is absent in any release whose corresponding release tag is not set if any release tags are set; otherwise the normal found/fixed rules apply.]
pt_pt: [Em outras palavras, se qualquer das tags de versão estão inseridas, o bug é inexistente em qualquer versão cuja tag daquela versão correspondente não está inserida.

source: Release tags should not be used if proper versioning of the bug would achieve the desired effect, as they require manual addition and removal.
pt_pt: Tags de versões não devem ser usadas se o versionamento adequado do bug conseguir o efeito desejado, uma vez que exigem a adição e a remoção manual.

source: If you are unsure if a release tag is required, contact the Debian BTS Administrators (owner@bugs.debian.org) or the release team for advice.
pt_pt: Se você não tem certeza se uma tag de versão é necessária, entre em contato com os(as) administradores(as) do Debian BTS (owner@bugs.debian.org) ou o time de versão para esclarecimentos.

source: Recording that you have passed on a bug report
pt_pt: Registrando que você encaminhou um relatório de bug

source: When a developer forwards a bug report to the developer of the upstream source package from which the Debian package is derived, they should note this in the bug tracking system as follows:
pt_pt: Quando um(a) desenvolvedor(a) encaminha um relatório de bugs para o(a) desenvolvedor(a) original do código fonte do qual o pacote Debian é derivado, deve-se anotar no sistema de acompanhamento de bugs como abaixo:

source: Make sure that the To field of your message to the author has only the author(s) address(es) in it; put the person who reported the bug, nnn-forwarded@bugs.debian.org and nnn@bugs.debian.org in the CC field.
pt_pt: Certifique-se de que o campo Para da sua mensagem para o(a) autor(a) possua apenas o endereço de e-email dele(a) (ou os endeços de e-mail no caso de ser mais de um(a) autor(a)); no campo Cc coloque: a pessoa que reportou o bug, nnn-forwarded@bugs.debian.org e nnn@bugs.debian.org.

source: Ask the author to preserve the CC to nnn-forwarded@bugs.debian.org when they reply, so that the bug tracking system will file their reply with the original report.
pt_pt: Peça ao(à) autor(a) para preservar o campo Cc deixando nnn-forwarded@bugs.debian.org quando responder, assim o sistema de acompanhamento de bugs irá arquivar a resposta com o relatório original.

source: These messages are only filed and are not sent on; to send a message as normal, send them to nnn@bugs.debian.org as well.
pt_pt: Estas mensagens são apenas arquivadas e não enviadas; para enviar uma mensagem da forma normal, envie-a para nnn@bugs.debian.org.

source: When the bug tracking system gets a message at nnn-forwarded it will mark the relevant bug as having been forwarded to the address(es) in the To field of the message it gets, if the bug is not already marked as forwarded.
pt_pt: Quando o sistema de acompanhamento de bugs recebe uma mensagem com nnn-forwarded, ele marca o bug relevante como tendo sido encaminhado para o(s) endereço(s) no campo Para da mensagem que ele recebe, caso o bug já não esteja marcado como encaminhado.

source: You can also manipulate the forwarded to information by sending messages to control@bugs.debian.org.
pt_pt: Você pode também manipular a informação forwarded to enviando mensagens para control@bugs.debian.org.

source: Changing bug ownership
pt_pt: Alterando o responsável pelo bug

source: In cases where the person responsible for fixing a bug is not the assigned maintainer for the associated package (for example, when the package is maintained by a team), it may be useful to record this fact in the bug tracking system.
pt_pt: Nos casos onde a pessoa responsável por consertar o bug não é o(a) mantenedor(a) do pacote (por exemplo, quando o pacote é mantido por uma equipe), pode ser útil registrar esse fato no sistema de processamento de bugs.

source: To help with this, each bug may optionally have an owner.
pt_pt: Para facilitar, cada bug pode opcionalmente ter um(a) dono(a).

source: The owner can be set by supplying an Owner line in the pseudo-header when the bug is submitted (see the instructions for reporting bugs), or by using the owner and noowner commands with the control request server.
pt_pt: O(A) dono(a) pode ser configurado(a) adicionando a linha Owner no pseudocabeçalho quando o bug é enviado (veja as instruções para relatar bugs), ou usando os comandos owner e noowner no servidor de requisição de controle.

source: Incorrectly listed package maintainers
pt_pt: Mantenedores(as) de pacotes listados(as) incorretamente

source: If the maintainer of a package is listed incorrectly, this is usually because the maintainer has changed recently, and the new maintainer hasn't yet uploaded a new version of the package with a changed Maintainer control file field.
pt_pt: Se o(a) mantenedor(a) de um pacote está listado(a) incorretamente, é porque, geralmente, o(a) mantenedor(a) mudou recentemente e o(a) novo(a) mantenedor(a) não fez o envio de uma nova versão do pacote com um campo Maintainer do arquivo de controle modificado.

source: This will be fixed when the package is uploaded; alternatively, the archive maintainers can override the maintainer record of a package manually, for example if a rebuild and reupload of the package is not expected to be needed soon.
pt_pt: Isto será corrigido quando o pacote for enviado; alternativamente, os(as) mantenedores(as) do repositório podem sobrescrever o registro do(a) mantenedor(a) de um pacote manualmente, por exemplo, se uma recompilação e um reenvio do pacote não são esperados tão cedo.

source: Contact override-change@debian.org for changes to the override file.
pt_pt: Entre em contato com override-change@debian.org para mudanças no arquivo de sobrescrita (override file).

source: Reopening, reassigning and manipulating bugs
pt_pt: Reabrindo, reatribuindo e manipulando bugs

source: It is possible to reassign bug reports to other packages, to reopen erroneously-closed ones, to modify the information saying to where, if anywhere, a bug report has been forwarded, to change the severities and titles of reports, to set the ownership of bugs, to merge and unmerge bug reports, and to record the versions of packages in which bugs were found and in which they were fixed.
pt_pt: É possível reatribuir relatórios de bugs para outros pacotes, reabrir bugs fechados erroneamente, modificar a informação dizendo para onde, caso exista, um relatório de bug foi encaminhado, mudar as severidades e títulos de relatórios, configurar o(a) responsável pelos bugs, juntar e separar relatórios de bugs e registrar as versões dos pacotes nos quais os bugs foram encontrados e em quais delas os bugs foram corrigidos.

source: This is done by sending mail to control@bugs.debian.org.
pt_pt: Isto é feito enviando e-mails para control@bugs.debian.org.

source: The format of these messages is described in another document available on the World Wide Web or in the file bug-maint-mailcontrol.txt.
pt_pt: O formato destas mensagens é descrito em outro documento disponível no web site, ou no arquivo bug-maint-mailcontrol.txt.

source: A plain text version can also be obtained by mailing the word help to the server at the address above.
pt_pt: Uma versão em texto puro também pode ser obtida enviando uma mensagem com a palavra help para o servidor no endereço acima.

source: Subscribing to bugs
pt_pt: Inscrevendo-se em bugs

source: The bug tracking system also allows bug submitters, developers and other interested third parties to subscribe to individual bugs.
pt_pt: O sistema de acompanhamento de bugs também permite que a pessoa que relatou o bug, os(as) desenvolvedores(as) e qualquer outra parte interessada, inscrevam-se em um bug específico.

source: This feature can be used by those wishing to keep an eye on a bug, without having to subscribe to a package through the Debian Package Tracker.
pt_pt: Esse recurso pode ser usado por aqueles(as) que desejam monitorar um bug, sem que seja necessário inscrever-se em um pacote através do rastreador de pacotes do Debian.

source: All messages that are received at nnn@bugs.debian.org, are sent to subscribers.
pt_pt: Todas as mensagens recebidas em nnn@bugs.debian.org, são enviadas aos(às) inscritos(as).

source: Subscribing to a bug can be done by sending an email to nnn-subscribe@bugs.debian.org.
pt_pt: A inscrição em um bug pode ser feita através do envio de um e-mail para nnn-subscribe@bugs.debian.org.

source: The subject and body of the email are ignored by the BTS.
pt_pt: O assunto e o conteúdo do e-mail são ignorados pelo BTS.

source: Once this message is processed, users are sent a confirmation message that they will need to reply to before they are sent the messages relating to that bug.
pt_pt: Uma vez que a mensagem seja processada, os(as) usuários(as) receberão um e-mail de confirmação que deve ser respondido para que eles(as) comecem a receber as mensagens relacionadas ao bug.

source: It is also possible to unsubscribe from a bug.
pt_pt: Também é possível cancelar a inscrição de um bug.

source: Unsubscribing can be done by sending an email to nnn-unsubscribe@bugs.debian.org.
pt_pt: O cancelamento da inscrição pode ser feita através do envio de um e-mail para nnn-unsubscribe@bugs.debian.org.

source: The subject and body of the email are again ignored by the BTS.
pt_pt: O assunto e o conteúdo do e-mail são novamente ignorados pelo BTS.

source: Users will be sent a confirmation message which they must reply to if they wish to be unsubscribed from the bug.
pt_pt: Os(As) usuários(as) receberão uma mensagem de confirmação que deve ser respondida para que eles(as) tenham as inscrições do bug canceladas.

source: By default, the address subscribed is the one found in the From header.
pt_pt: Por padrão, o endereço inscrito é aquele encontrado no campo De do cabeçalho da mensagem.

source: If you wish to subscribe another address to a bug, you will need to encode the address to be subscribed into the subscription message.
pt_pt: Se você deseja inscrever um outro endereço de e-mail em um bug, você terá que codificar o endereço a ser inscrito dentro da mensagem de inscrição.

source: This takes the form of: nnn-subscribe-localpart=example.com@bugs.debian.org.
pt_pt: Eis o formato utilizado para isso: nnn-subscribe-localpart=example.com@bugs.debian.org.

source: That example would send localpart@example.com a subscription message for bug nnn.
pt_pt: Esse exemplo enviaria à localpart@example.com uma mensagem de inscrição no bug nnn.

source: The @ sign must be encoded by changing it to an = sign.
pt_pt: O símbolo @ deve ser codificado mudando para o símbolo =.

source: Similarly, an unsubscription takes the form nnn-unsubscribe-localpart=example.com@bugs.debian.org.
pt_pt: Similarmente, um cancelamento de inscrição utilizaria o seguinte formato: nnn-unsubscribe-localpart=example.com@bugs.debian.org.

source: In both cases, the subject and body of the email will be forwarded to the email address within the request for confirmation.
pt_pt: Em ambos os casos, o assunto e o corpo do e-mail serão encaminhados ao endereço contido na requisição de confirmação.

source: More-or-less obsolete subject-scanning feature
pt_pt: Recurso mais ou menos obsoleto de procura por assunto

source: Messages that arrive at submit or bugs whose Subject starts Bug#nnn will be treated as having been sent to nnn@bugs.debian.org.
pt_pt: Mensagens que chegam em submit ou bugs cujo campo assunto inicie com Bug#nnn serão tratadas como tendo sido enviadas para nnn@bugs.debian.org.

source: This is both for backwards compatibility with mail forwarded from the old addresses, and to catch followup mail sent to submit by mistake (for example, by using reply to all recipients).
pt_pt: Isto é para compatibilidade retroativa com mensagens encaminhadas a partir do endereço antigo e para pegar mensagens enviadas para submit por engano (por exemplo, usando "responder para todos os destinatários").

source: A similar scheme operates for maintonly, done, quiet and forwarded, which treat mail arriving with a Subject tag as having been sent to the corresponding nnn-whatever@bugs.debian.org address.
pt_pt: Um esquema similar opera para maintonly, done, quiet e forwarded, os quais tratam mensagens que chegam com uma tag Subject como tendo sido enviadas para o endereço nnn-qualquercoisa@bugs.debian.org correspondente.

source: Messages arriving at plain forwarded and done — ie, with no bug report number in the address — and without a bug number in the Subject will be filed under junk and kept for a few weeks, but otherwise ignored.
pt_pt: Mensagens que chegam com forwarded puro e done — isto é, sem o número do relatório de bugs no endereço — e sem um número de bug no campo assunto serão arquivadas como junk e mantidas por algumas semanas, mas por outro lado serão ignoradas.

source: Obsolete X-Debian-PR: quiet feature
pt_pt: Recurso obsoleto X-Debian-PR: quiet

source: It used to be possible to prevent the bug tracking system from forwarding anywhere messages it received at debian-bugs, by putting an X-Debian-PR: quiet line in the actual mail header.
pt_pt: É usado para ser possível prevenir que o sistema de acompanhamento de bugs encaminhe para qualquer lugar mensagens que o mesmo recebeu em debian-bugs, colocando uma linha X-Debian-PR: quiet no cabeçalho da mensagem atual.

source: This header line is now ignored.
pt_pt: Esta linha de cabeçalho é agora ignorada.

source: Instead, send your message to quiet or nnn-quiet (or maintonly or nnn-maintonly).
pt_pt: Em vez disso, envie sua mensagem para quiet ou nnn-quiet (ou maintonly ou nnn-maintonly).

source: dansk Deutsch español français Italiano Nederlands 日本語 (Nihongo) norsk (bokmål) polski Português Русский (Russkij) svenska
pt_pt: dansk Deutsch English español français Italiano Nederlands 日本語 (Nihongo) norsk (bokmål) polski Русский (Russkij) svenska

source: Last Modified: Sun, Mar 27 08:46:06 UTC 2022 Last Built: Fri, Aug 16 23:25:38 UTC 2024
pt_pt: Última Modificação: Seg, 18 de Abr de 2022, 10:28:35 UTC Última compilação: Sex, 16 de Ago de 2024, 20:09:27 UTC

source: Debian Developers' Corner / Debian Project Secretary
pt_pt: Canto dos(as) desenvolvedores(as) Debian / Secretário(a) do projeto Debian

source: The Debian Project Secretary
pt_pt: O(A) secretário(a) do projeto Debian

source: As the Debian project grew, it became apparent that there needed to be a set of semi-formal rules to help in conflict resolution, and as a result the constitution was written.
pt_pt: Com o crescimento do projeto Debian, ficou claro que era necessário ter um conjunto de regras semiformais para ajudar na resolução de conflitos e, como resultado, a constituição foi escrita.

source: The Debian constitution describes the organisational structure for formal decision making in the Project.
pt_pt: A constituição do Debian descreve a estrutura organizacional para a tomada de decisões formais no projeto.

source: The constitution delineates who makes decisions, and what powers are attached to each such decision making individual or body.
pt_pt: A constituição delineia quem toma as decisões e quais os poderes de cada um desses indivíduos ou grupos que tomam as decisões.

source: The office of the Project Secretary is one of the six entities enumerated in the Debian constitution as a decision making entity.
pt_pt: O cargo de secretário(a) do projeto é uma das seis entidades enumeradas na constituição do Debian como entidades tomadoras de decisão.

source: Any Debian developer is eligible to be considered for the post of the Debian Project Secretary.
pt_pt: Qualquer desenvolvedor(a) Debian é elegível para ser considerado(a) para o posto de secretário(a) do projeto Debian.

source: Any person may hold several posts, except that the Project Secretary may not also be the Debian Project Leader, or the Chair of the Technical Committee.
pt_pt: Qualquer pessoa pode ter vários postos, exceto que o(a) secretário(a) do projeto não pode ser também o(a) líder do projeto Debian, ou o(a) presidente do Comitê Técnico.

source: Appointment
pt_pt: Apontamento

source: Unlike other delegates, who are appointed by the Project Leader, the next Project Secretary is appointed by the Project Leader and the current Project Secretary.
pt_pt: Ao contrário dos outros(as) delegados(as), que são apontados pelo(a) líder do projeto, o(a) próximo(a) secretário(a) do projeto é apontado(a) pelo(a) líder do projeto e pelo(a) secretário(a) do projeto atual.

source: In case the current secretary and the project leader disagree, they must ask the Developers by way of general resolution to appoint a Secretary.
pt_pt: Caso o(a) secretário(a) atual e o(a) líder do projeto discordem, eles(as) devem pedir aos(às) desenvolvedores(as) por meio de resolução geral que nomeiem um(a) secretário(a).

source: Tasks performed by the Project Secretary
pt_pt: Tarefas realizadas pelo(a) secretário(a) do projeto

source: Conducting votes
pt_pt: Condução de votações

source: The most visible task performed by the secretary is conducting votes for the project -- notably the Project Leader elections, but also any other votes that are run (General Resolutions, for example).
pt_pt: A tarefa mais visível realizada pelo(a) secretário(a) é a condução das votações para o projeto -- notavelmente as eleições do(a) líder do projeto, mas também qualquer outra votação que for feita (resoluções gerais, por exemplo).
